1.IDE

In [1]:
conda --version

conda 4.10.1

Note: you may need to restart the kernel to use updated packages.

3.Pandas

In [2]:
import pandas as pd
df = pd.read_csv("../data/Homework 0 Data/Salaries.csv")
df

       yearID teamID lgID   playerID    salary
0        1985    ATL   NL  barkele01    870000
1        1985    ATL   NL  bedrost01    550000
2        1985    ATL   NL  benedbr01    545000
3        1985    ATL   NL   campri01    633333
4        1985    ATL   NL  ceronri01    625000
...       ...    ...  ...        ...       ...
25570    2015    WAS   NL  treinbl01    512800
25571    2015    WAS   NL  ugglada01    507500
25572    2015    WAS   NL  werthja01  21000000
25573    2015    WAS   NL  zimmejo02  16500000
25574    2015    WAS   NL  zimmery01  14000000

[25575 rows x 5 columns]

In [3]:
df1 = pd.read_csv("../data/Homework 0 Data/Salaries.csv", header=0, index_col=3, skiprows=[1])
df1

           yearID teamID lgID    salary
playerID
bedrost01    1985    ATL   NL    550000
benedbr01    1985    ATL   NL    545000
campri01     1985    ATL   NL    633333
ceronri01    1985    ATL   NL    625000
chambch01    1985    ATL   NL    800000
...           ...    ...  ...       ...
treinbl01    2015    WAS   NL    512800
ugglada01    2015    WAS   NL    507500
werthja01    2015    WAS   NL  21000000
zimmejo02    2015    WAS   NL  16500000
zimmery01    2015    WAS   NL  14000000

[25574 rows x 4 columns]

In [4]:
df[(df['teamID'] =='HOU') | (df['teamID'] =='ATL') & (df['salary']>1000000)]['playerID']

10       hornebo01
15       murphda05
20       suttebr01
202      ashbyal01
203       basske01
           ...
25055    singljo02
25056     sippto01
25057    springe01
25058    thatcjo01
25059    valbulu01
Name: playerID, Length: 1178, dtype: object

In [5]:
df[df['teamID'] =='ATL']['salary'].describe()

count    8.860000e+02
mean     2.206239e+06
std      3.432673e+06
min      6.000000e+04
25%      3.000000e+05
50%      6.000000e+05
75%      2.390625e+06
max      1.606180e+07
Name: salary, dtype: float64

In [6]:
data_dic = dict()
data_dic['yearID'] = []
data_dic['teamID'] = []
data_dic['lgID'] = []
data_dic['playerID'] = []
data_dic['salary'] = []

for id, row in df.iterrows():
    data_dic['yearID'].append(row['yearID'])
    data_dic['teamID'].append(row['teamID'])
    data_dic['lgID'].append(row['lgID'])
    data_dic['playerID'].append(row['playerID'])
    data_dic['salary'].append(row['salary'])

# data_dic

data_dic2 = df.to_dict()

In [7]:
print(1)

1